src/mp_toir/Documents/РегистрацияДефекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РегистрацияДефекта</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДефектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:EnumRef.мп_ИсточникиДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.мп_СтатусыОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектЭксплуатации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеОписаниеДефекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособУстранения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДефекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДефектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Критичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Мечел_КритичностьДефекта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКИС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияДанныхЕРП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаУстранение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Дефекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Узел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УзлыОбъектовЭксплуатации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дефект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Мечел_ДефектыОборудования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособУстранения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Мечел_СпособыУстраненияДефектов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДефектУстранен</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаУстранения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеУстранения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФиксацияДефекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиДефекта</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиФиксацииДефекта</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФотоДефекта</Name>
							<Comment>Для выгрузки в ЕРП</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФотоДефектаПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасширениеФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьСтроку</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФиксацияУстранения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиДефекта</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиУстраненияДефекта</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФотоУстранения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФотоУстраненияПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасширениеФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьСтроку</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/mp_toir/Enums/мп_ИсточникиДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>мп_ИсточникиДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МечелТОиР</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/mp_toir/Enums/мп_СтатусыОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>мп_СтатусыОбмена</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КВыгрузкеВКИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагруженИзМП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгруженВКИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгруженВМП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагруженИзКИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КВыгрузкеВМП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/mp_toir/Enums/Мечел_ГруппаТиповУзлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Мечел_ГруппаТиповУзлов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЕО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Узел</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Иное</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/mp_toir/Documents/РегистрацияДефекта/Forms/ФормаСтрокиДефекта/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ИменаСтраниц;

&НаКлиенте
Перем ТекущийИндексСтраницы;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ИменаСтраниц = Новый Массив;
	ИменаСтраниц.Добавить("ДанныеДефекта");
	ИменаСтраниц.Добавить("ФотоДефекта");
	ИменаСтраниц.Добавить("ФотоУстраненияДефекта");

	ЭтотОбъект.КоличествоСтраниц = ИменаСтраниц.Количество() - 1;

	ТекущийИндексСтраницы = 0;
	ЗаголовокТекущейСтраницы(ТекущийИндексСтраницы);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ИменаЭлементов = "ОбъектЭксплуатации, Узел, Дефект, ДефектУстранен, СпособУстранения, ДатаУстранения"
			+ ", ОписаниеУстранения, НомерСтроки, ИдентификаторСтроки, СтатусОбмена, Источник";
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, ИменаЭлементов);

	ЗаполнитьТаблицуФиксацияДефекта(Параметры.ФиксацияДефекта);
	
	ЗаполнитьТаблицуУстранениеДефекта(Параметры.ФиксацияУстранения);

	Элементы.ПредставлениеСтраницы.Заголовок = Элементы.ДанныеДефекта.Заголовок;
	ДоступностьРеквизитов(ИменаЭлементов);
	
КонецПроцедуры

&НаСервере
Процедура ДоступностьРеквизитов(Знач ИменаЭлементов)

	ИменаКнопок = "ФормаСохранить, ФиксацияДефектаСделатьФотоДефекта, ПриложитьФотоДефекта,"
		+ "ФиксацияУстраненияСделатьФотоУстранения, ФиксацияУстраненияВыбратьФотоУстранения,"
		+ "ФиксацияДефектаКонтекстноеМенюУдалитьСтрокуФотоДефекта,"
		+ "ФиксацияУстраненияКонтекстноеМенюУдалитьСтрокуФиксацияУстранения";

	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(
		Элементы, ИменаЭлементов + ", " + ИменаКнопок, "Доступность", Не Параметры.ТолькоПросмотр);

	Если ЭтотОбъект.Источник = Перечисления.мп_ИсточникиДокументов.КИС Тогда
		ДоступноДляРедактирования = Новый Массив;
		ДоступноДляРедактирования.Добавить("ФормаКоманднаяПанель");
		ДоступноДляРедактирования.Добавить("ФормаСохранить");
		ДоступноДляРедактирования.Добавить("ФормаОтмена");
		ДоступноДляРедактирования.Добавить("ГруппаСтраницыДефектов");
		ДоступноДляРедактирования.Добавить("ДанныеДефекта");
		ДоступноДляРедактирования.Добавить("ФотоДефекта");
		ДоступноДляРедактирования.Добавить("ФотоУстраненияДефекта");
		ДоступноДляРедактирования.Добавить("ФиксацияДефекта");
		ДоступноДляРедактирования.Добавить("ФиксацияДефектаСделатьФотоДефекта");
		ДоступноДляРедактирования.Добавить("ПриложитьФотоДефекта");
		ДоступноДляРедактирования.Добавить("ФотоУстраненияДефекта");
		ДоступноДляРедактирования.Добавить("ФиксацияУстранения");
		ДоступноДляРедактирования.Добавить("ФиксацияДефектаКоманднаяПанель");
		ДоступноДляРедактирования.Добавить("ФиксацияУстраненияКоманднаяПанель");
		ДоступноДляРедактирования.Добавить("ФиксацияУстраненияСделатьФотоУстранения");
		ДоступноДляРедактирования.Добавить("ФиксацияУстраненияВыбратьФотоУстранения");
		ДоступноДляРедактирования.Добавить("ДефектУстранен");
		ДоступноДляРедактирования.Добавить("ДатаУстранения");
		ДоступноДляРедактирования.Добавить("СпособУстранения");
		ДоступноДляРедактирования.Добавить("ОписаниеУстранения");
		Если ОбщегоНазначенияВызовСервера.АдминистраторТОиР() Тогда
			ДоступноДляРедактирования.Добавить("Узел");
			ДоступноДляРедактирования.Добавить("Дефект");
		КонецЕсли;
		ЗакрытьДляРедактирования = Новый Массив;
		Для Каждого ТекЭлемент Из Элементы Цикл
			Если ТипЗнч(ТекЭлемент) = Тип("ДекорацияФормы") Тогда
				Продолжить;
			КонецЕсли;
			СтруктураСвойств = Новый Структура("ТолькоПросмотр");
			Если ДоступноДляРедактирования.Найти(ТекЭлемент.Имя) = Неопределено Тогда
				ЗаполнитьЗначенияСвойств(СтруктураСвойств, ТекЭлемент);
				Если СтруктураСвойств.ТолькоПросмотр <> Неопределено Тогда
					ЗакрытьДляРедактирования.Добавить(ТекЭлемент.Имя);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(
			Элементы, ДоступноДляРедактирования, "Доступность", Истина);
			
			
		ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(
			Элементы, ЗакрытьДляРедактирования, "Доступность", Ложь);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	ЗначенияСтроки = Новый Структура;
	ЗначенияСтроки.Вставить("ОбъектЭксплуатации", ЭтотОбъект.ОбъектЭксплуатации);
	ЗначенияСтроки.Вставить("Узел", ЭтотОбъект.Узел);
	ЗначенияСтроки.Вставить("Дефект", ЭтотОбъект.Дефект);
	ЗначенияСтроки.Вставить("ДефектУстранен", ЭтотОбъект.ДефектУстранен);
	ЗначенияСтроки.Вставить("ДатаУстранения", ЭтотОбъект.ДатаУстранения);
	ЗначенияСтроки.Вставить("ОписаниеУстранения", ЭтотОбъект.ОписаниеУстранения);
	ЗначенияСтроки.Вставить("СпособУстранения", ЭтотОбъект.СпособУстранения);
	ЗначенияСтроки.Вставить("ИдентификаторСтроки", ЭтотОбъект.ИдентификаторСтроки);
	ЗначенияСтроки.Вставить("НомерСтроки", ЭтотОбъект.НомерСтроки);
	ЗначенияСтроки.Вставить("ФиксацияДефекта", ЭтотОбъект.ФиксацияДефекта);
	ЗначенияСтроки.Вставить("СохранитьИзменения", ЭтотОбъект.СохранитьИзменения);
	ОповеститьОВыборе(ЗначенияСтроки);

КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	ЭтотОбъект.СохранитьИзменения = Истина;
	Если Не СостояниеРеквизитовСтроки() Тогда
		ЭтотОбъект.СохранитьИзменения = Ложь;
		Возврат;
	КонецЕсли;
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ЭтотОбъект.СохранитьИзменения = Ложь;
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура УзелОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	ПроверкаУзла(ВыбранноеЗначение);
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыДефектовПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ТекущийИндексСтраницы = ИменаСтраниц.Найти(ТекущаяСтраница.Имя);
	ЗаголовокТекущейСтраницы(ТекущийИндексСтраницы);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Страница1(Команда)
	НовыйИндекс = Макс(ТекущийИндексСтраницы - 1, 0);
	ТекущийИндексСтраницы = НовыйИндекс;
	ЗаголовокТекущейСтраницы(ТекущийИндексСтраницы);
КонецПроцедуры

&НаКлиенте
Процедура Страница2(Команда)
	НовыйИндекс = Мин(ТекущийИндексСтраницы + 1, ЭтотОбъект.КоличествоСтраниц);
	ТекущийИндексСтраницы = НовыйИндекс;
	ЗаголовокТекущейСтраницы(ТекущийИндексСтраницы);
КонецПроцедуры

&НаКлиенте
Процедура ДефектУстраненПриИзменении(Элемент)

	Если ЭтотОбъект.ДефектУстранен = 1 Тогда
		ЭтотОбъект.ДатаУстранения = ОбщегоНазначенияВызовСервера.ТекущаяДатаСервера();
	Иначе
		ЭтотОбъект.ДатаУстранения = Дата(1, 1, 1);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Асинх Процедура ВыбратьФотоДефекта(Команда)

	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыДиалога.МножественныйВыбор = Ложь;
	ПараметрыДиалога.Заголовок = НСтр("ru = 'Выберите файл'; en = 'Select file'");
	ПараметрыДиалога.Фильтр =  "Изображения|*.png;*.jpg;*.jpeg";
	ЗавершениеОбратныйВызов = Новый ОписаниеОповещения("ЗавершениеОбратныйВызов", ЭтотОбъект, "ФиксацияДефекта");
	ПрогрессОбратныйВызов = Новый ОписаниеОповещения("ПрогрессОбратныйВызов", ЭтотОбъект);
	ПередНачаломОбратныйВызов = Новый ОписаниеОповещения("ПередНачаломОбратныйВызов", ЭтотОбъект);
	НачатьПомещениеФайлаНаСервер(ЗавершениеОбратныйВызов, ПрогрессОбратныйВызов, ПередНачаломОбратныйВызов, ,
		ПараметрыДиалога, ЭтотОбъект.УникальныйИдентификатор);

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьФотоУстранения(Команда)
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыДиалога.МножественныйВыбор = Ложь;
	ПараметрыДиалога.Заголовок = НСтр("ru = 'Выберите файл'; en = 'Select file'");
	ПараметрыДиалога.Фильтр =  "Изображения|*.png;*.jpg;*.jpeg";
	ЗавершениеОбратныйВызов = Новый ОписаниеОповещения("ЗавершениеОбратныйВызов", ЭтотОбъект, "УстранениеДефекта");
	ПрогрессОбратныйВызов = Новый ОписаниеОповещения("ПрогрессОбратныйВызов", ЭтотОбъект);
	ПередНачаломОбратныйВызов = Новый ОписаниеОповещения("ПередНачаломОбратныйВызов", ЭтотОбъект);
	НачатьПомещениеФайлаНаСервер(ЗавершениеОбратныйВызов, ПрогрессОбратныйВызов,
		ПередНачаломОбратныйВызов, , ПараметрыДиалога, ЭтотОбъект.УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура СделатьФотоДефекта(Команда)
	
	#Если НЕ МобильноеПриложениеКлиент Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Функция не поддерживается");
		Возврат;
	#КонецЕсли
	
	// Результат = СредстваМультимедиа.СделатьФотоснимок();
	Результат = Вычислить("СредстваМультимедиа.СделатьФотоснимок()");
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РасширениеФайла = Результат.РасширениеФайла;
	ИнициализироватьКартинкуНаФормеФиксацияДефекта(Результат.ПолучитьДвоичныеДанные(), РасширениеФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура СделатьФотоУстранения(Команда)
	
	#Если НЕ МобильноеПриложениеКлиент Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Функция не поддерживается");
		Возврат;
	#КонецЕсли
	
	Результат = Вычислить("СредстваМультимедиа.СделатьФотоснимок()");

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РасширениеФайла = Результат.РасширениеФайла;
	ИнициализироватьКартинкуНаФормеУстраненияДефекта(Результат.ПолучитьДвоичныеДанные(), РасширениеФайла);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыФиксацияДефекта

&НаКлиенте
Процедура ПоказатьФотоДефекта(Команда)
	АдресФото = ПолучитьИзВременногоХранилища(Элементы.ФиксацияДефекта.ТекущиеДанные.ФотоДефектаПредставление);
	ПоказатьЗначение( , АдресФото);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтрокуФотоДефекта(Команда)
	
	ТекущиеДанные = Элементы.ФиксацияДефекта.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьСтроку = ТекущиеДанные.УдалитьСтроку;
	
	Если Не УдалитьСтроку И Не РазрешеноПометитьНаУдалениеФото(ЭтотОбъект.СтатусОбмена) Тогда
		Возврат;
	КонецЕсли;
		
	Элементы.ФиксацияДефекта.ТекущиеДанные.УдалитьСтроку = ?(УдалитьСтроку = Истина, Ложь, Истина);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыФиксацияУстранения

&НаКлиенте
Процедура УдалитьСтрокуФиксацияУстранения(Команда)

	УдалитьСтроку = Элементы.ФиксацияУстранения.ТекущиеДанные.УдалитьСтроку;
	Если Не УдалитьСтроку И Не РазрешеноПометитьНаУдалениеФото(ЭтотОбъект.СтатусОбмена) Тогда
		Возврат;
	КонецЕсли;

	Элементы.ФиксацияУстранения.ТекущиеДанные.УдалитьСтроку = ?(УдалитьСтроку = Истина, Ложь, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция СостояниеРеквизитовСтроки()
	
	СостояниеРеквизитов = Истина;

	ПустойУзел = ПредопределенноеЗначение("Справочник.УзлыОбъектовЭксплуатации.ПустаяСсылка");
	ПустойДефект = ПредопределенноеЗначение("Справочник.Мечел_ДефектыОборудования.ПустаяСсылка");
	ПустойСпособУстранения = ПредопределенноеЗначение("Перечисление.Мечел_СпособыУстраненияДефектов.ПустаяСсылка");
	
	Если ПустойУзел = ЭтотОбъект.Узел Тогда
		СостояниеРеквизитов = Ложь;
		ОбщегоНазначенияКлиент.СообщитьПользователю("Укажите узел", , "Узел");
	КонецЕсли;
	
	Если ПустойДефект = ЭтотОбъект.Дефект Тогда
		СостояниеРеквизитов = Ложь;
		ОбщегоНазначенияКлиент.СообщитьПользователю("Укажите дефект", , "Узел");
	КонецЕсли;
	
	Если ПустойСпособУстранения = ЭтотОбъект.СпособУстранения Тогда
		СостояниеРеквизитов = Ложь;
		ОбщегоНазначенияКлиент.СообщитьПользователю("Укажите способ устранения", , "Узел");
	КонецЕсли;
	
	Если ПустаяСтрока(ЭтотОбъект.ОписаниеУстранения) Тогда
		СостояниеРеквизитов = Ложь;
		ОбщегоНазначенияКлиент.СообщитьПользователю("Укажите описание устранения", , "ОписаниеУстранения");
	КонецЕсли;
	
	Если Не ПроверкаУзла(ЭтотОбъект.Узел) Тогда
		СостояниеРеквизитов = Ложь;
	КонецЕсли;
	
	Возврат СостояниеРеквизитов;
	
КонецФункции

&НаКлиенте
Процедура ИнициализироватьКартинкуНаФормеФиксацияДефекта(ДанныеКартинки, РасширениеФайла)

	Если ДанныеКартинки <> Неопределено Тогда
		
		ИдентификаторСтрокиФиксацииДефекта = Новый УникальныйИдентификатор;
		АдресФото = ПоместитьВоВременноеХранилище(ДанныеКартинки, ИдентификаторСтрокиФиксацииДефекта);
		ТекущаяДата = ОбщегоНазначенияВызовСервера.ТекущаяДатаСервера();
		ТекущаяДатаСтрока = Формат( ТекущаяДата, "ДФ='yyyy_MM_dd'") + " время " + Формат( ТекущаяДата, "ДФ='HH_mm_ss'");
		НоваяСтрока = ЭтотОбъект.ФиксацияДефекта.Добавить();
		НоваяСтрока.ЭтоНоваяСтрока = Истина;
		НоваяСтрока.ИдентификаторСтрокиДефекта = ЭтотОбъект.ИдентификаторСтроки;
		НоваяСтрока.ИдентификаторСтрокиФиксацииДефекта = ИдентификаторСтрокиФиксацииДефекта;
		НоваяСтрока.ФотоДефекта = ПоместитьКартинку_ФотоФайлДвоичный(ДанныеКартинки);
		НоваяСтрока.ФотоДефектаПредставление = АдресФото;
		НоваяСтрока.РасширениеФайла = РасширениеФайла;
		НоваяСтрока.ИмяФайла = "мп_ФиксацияДефекта" + ТекущаяДатаСтрока + "." + РасширениеФайла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнициализироватьКартинкуНаФормеУстраненияДефекта(ДанныеКартинки, РасширениеФайла)

	Если ДанныеКартинки <> Неопределено Тогда
		
		ИдентификаторСтрокиДефекта = Новый УникальныйИдентификатор;
		АдресФото = ПоместитьВоВременноеХранилище(ДанныеКартинки, ИдентификаторСтрокиДефекта);
		ТекущаяДата = ОбщегоНазначенияВызовСервера.ТекущаяДатаСервера();
		ТекущаяДатаСтрока = Формат( ТекущаяДата, "ДФ='yyyy_MM_dd'") + " время " + Формат( ТекущаяДата, "ДФ='HH_mm_ss'");
		НоваяСтрока = ЭтотОбъект.ФиксацияУстранения.Добавить();
		НоваяСтрока.ЭтоНоваяСтрока = Истина;
		НоваяСтрока.ИдентификаторСтрокиДефекта = ЭтотОбъект.ИдентификаторСтроки;
		НоваяСтрока.ИдентификаторСтрокиУстраненияДефекта = ИдентификаторСтрокиДефекта;
		НоваяСтрока.ФотоУстранения = ПоместитьКартинку_ФотоФайлДвоичный(ДанныеКартинки);
		НоваяСтрока.ФотоУстраненияПредставление = АдресФото;
		НоваяСтрока.РасширениеФайла = РасширениеФайла;
		НоваяСтрока.ИмяФайла = "мп_УстранениеДефекта" + ТекущаяДатаСтрока + "." + РасширениеФайла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПоместитьКартинку_ФотоФайлДвоичный(Знач ДанныеКартинки)

	Строка64  = Base64Строка(ДанныеКартинки);
	Возврат Строка64;

КонецФункции

&НаСервереБезКонтекста
Функция РасширениеФайлаИзДвоичныхДанных(Знач ДвоичныеДанные)
	ШестнадцатеричнаяСтрока = Лев(СтрЗаменить(Строка(ДвоичныеДанные), " ", ""), 16);
	РасширениеФайла = "";
	Если ШестнадцатеричнаяСтрока = "89504E470D0A1A0A" Тогда
		РасширениеФайла = "png";
	ИначеЕсли Лев(ШестнадцатеричнаяСтрока, 6) = "FFD8FF" Тогда
		РасширениеФайла = "jpg";
	ИначеЕсли Лев(ШестнадцатеричнаяСтрока, 8) = "47494638" Тогда
		РасширениеФайла = "gif";
	ИначеЕсли Лев(ШестнадцатеричнаяСтрока, 4) = "424D" Тогда
		РасширениеФайла = "bmp";
	Иначе
		РасширениеФайла = "";
	КонецЕсли;
	
	Возврат РасширениеФайла;
КонецФункции

&НаКлиенте
Процедура ЗавершениеОбратныйВызов(ОписаниеПомещенногоФайла, ДополнительныеПараметры) Экспорт

	Если ОписаниеПомещенногоФайла = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(ОписаниеПомещенногоФайла.Адрес);
	РасширениеФайла = РасширениеФайлаИзДвоичныхДанных(ДвоичныеДанные);
	Если ДополнительныеПараметры = "ФиксацияДефекта" Тогда
		ИнициализироватьКартинкуНаФормеФиксацияДефекта(ДвоичныеДанные, РасширениеФайла);
	ИначеЕсли ДополнительныеПараметры = "УстранениеДефекта" Тогда
		ИнициализироватьКартинкуНаФормеУстраненияДефекта(ДвоичныеДанные, РасширениеФайла);
	Иначе
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПрогрессОбратныйВызов(ПомещаемыйФайл, Помещено, ОтказОтПомещенияФайла, ДополнительныеПараметры) Экспорт

	ТекстСообщения = СтрШаблон(НСтр("ru = 'Загрузка файла %1'; en = 'Uploading file %1'"), ПомещаемыйФайл.Имя);
	РазмерФайла = СтрШаблон(Нстр("ru = 'Размер файла %1 байт'; en = 'File size %1 bytes'"), ПомещаемыйФайл.Размер());
	
	Состояние(ТекстСообщения, Помещено, РазмерФайла, БиблиотекаКартинок.Картинка);

КонецПроцедуры

&НаКлиенте
Процедура ПередНачаломОбратныйВызов(ПомещаемыйФайл, ОтказОтПомещенияФайла, ДополнительныеПараметры) Экспорт
	ЗначенияКонстант = ЗначенияКонстант();
	МаксимальныйРазмерФото = ЗначенияКонстант["МаксимальныйРазмерФото"];
	МегабайтВБайтах = МаксимальныйРазмерФото * 1000000;
	Если ПомещаемыйФайл.Размер() > МегабайтВБайтах Тогда
		ОтказОтПомещенияФайла = Истина;
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Отказ. Загружаемый файл «%1» имеет размер более 5 мегабайт';
		|en = 'Failure. The uploaded file «%1» is larger than 1 megabyte'"), ПомещаемыйФайл.Имя);
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Сообщить();
		ОтказОтПомещенияФайла = Истина;
	Иначе
		ПоказатьОповещениеПользователя(НСтр("ru = 'Загрузка файла'; en = 'Uploading file'"), , ПомещаемыйФайл.Имя);
	КонецЕсли;  

КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗначенияКонстант()
	ЗначенияКонстант = ОбщегоНазначенияСервер.ПолучитьЗначенияКонстант();
	Возврат ЗначенияКонстант;
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуФиксацияДефекта(Знач ФиксацияДефектаПараметра)
	ТаблицаФиксацияДефекта = ФиксацияДефектаПараметра.Выгрузить();
	Отбор = Новый Структура;
	Отбор.Вставить("ИдентификаторСтрокиДефекта", ЭтотОбъект.ИдентификаторСтроки);
	
	ТаблицаПоСтрокеДефекта = ТаблицаФиксацияДефекта.Скопировать(Отбор);
	
	ЭтотОбъект.ФиксацияДефекта.Загрузить(ТаблицаПоСтрокеДефекта);
	
	Для Каждого ТекСтрока Из ЭтотОбъект.ФиксацияДефекта Цикл
		ДанныеКартинки = Base64Значение(ТекСтрока.ФотоДефекта);
		ТекСтрока.ФотоДефектаПредставление = 
			ПоместитьВоВременноеХранилище(
				ДанныеКартинки, ТекСтрока.ИдентификаторСтрокиФиксацииДефекта);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуУстранениеДефекта(Знач УстранениеДефектаПараметр)
	ТаблицаУстраненияДефекта = УстранениеДефектаПараметр.Выгрузить();
	Отбор = Новый Структура;
	Отбор.Вставить("ИдентификаторСтрокиДефекта", ЭтотОбъект.ИдентификаторСтроки);
	
	ТаблицаПоСтрокеУстраненияДефекта = ТаблицаУстраненияДефекта.Скопировать(Отбор);
	
	ЭтотОбъект.ФиксацияУстранения.Загрузить(ТаблицаПоСтрокеУстраненияДефекта);
	
	Для Каждого ТекСтрока Из ЭтотОбъект.ФиксацияУстранения Цикл
		ДанныеКартинки = Base64Значение(ТекСтрока.ФотоУстранения);
		ТекСтрока.ФотоУстраненияПредставление = 
			ПоместитьВоВременноеХранилище(
				ДанныеКартинки, ТекСтрока.ИдентификаторСтрокиУстраненияДефекта);
	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Функция РазрешеноПометитьНаУдалениеФото(ТекущийСтатус)
	
	Если РольДоступна("ПолныеПрава") Или РольДоступна("мп_АдминистрированиеТОиР") Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат (Перечисления.мп_СтатусыОбмена.Создан = ТекущийСтатус);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПроверкаУзла(Знач ВыбранныйУзел)
	
	ГруппаТиповУзлов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыбранныйУзел, "ГруппаТиповУзлов");
	Если Не ГруппаТиповУзлов = Перечисления.Мечел_ГруппаТиповУзлов.Узел Тогда
		ОбщегоНазначения.СообщитьПользователю("Нужно выбирать узел с группой типов узлов: <<Узел>>");
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ЗаголовокТекущейСтраницы(ТекущийИндексСтраницы)
	ИмяСтраницы = ИменаСтраниц[ТекущийИндексСтраницы];
	Страница = Элементы.Найти(ИмяСтраницы);
	Если Страница = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Элементы.ПредставлениеСтраницы.Заголовок = Страница.Заголовок;
	Элементы.ГруппаСтраницыДефектов.ТекущаяСтраница = Страница;
	ЗаголовокГруппыСтраниц = СтрШаблон("Всего: %1 этапа", ЭтотОбъект.КоличествоСтраниц + 1);
	Элементы.ГруппаСтраницы.Заголовок = ЗаголовокГруппыСтраниц;
КонецПроцедуры

#КонецОбласти
